quanhengwen/Franke/STM32F103VET6/BSP/AT24CXX/bsp_EEPROM.h
#ifndef __I2C_EEPROM_H__
#define	__I2C_EEPROM_H__
/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* 类型定义 ------------------------------------------------------------------*/
/* 宏定义 --------------------------------------------------------------------*/
#define I2C_OWN_ADDRESS                            0x0A

#define I2C_WR	        0		/* 写控制bit */
#define I2C_RD	        1		/* 读控制bit */

#define I2C_GPIO_CLK_ENABLE()               __HAL_RCC_GPIOB_CLK_ENABLE()
//#define I2C_GPIO_PORT                       GPIOB
//#define I2C_SCL_PIN                         GPIO_PIN_6
//#define I2C_SDA_PIN                         GPIO_PIN_7
//#define SCL2_Pin GPIO_PIN_10
//#define SCL2_GPIO_Port GPIOB
//#define SDA2_Pin GPIO_PIN_11
//#define SDA2_GPIO_Port GPIOB

#define I2C_SCL_HIGH()                      HAL_GPIO_WritePin(SCL2_GPIO_Port,SCL2_Pin,GPIO_PIN_SET)    // 输出高电平
#define I2C_SCL_LOW()                       HAL_GPIO_WritePin(SCL2_GPIO_Port,SCL2_Pin,GPIO_PIN_RESET)  // 输出低电平
#define I2C_SDA_HIGH()                      HAL_GPIO_WritePin(SDA2_GPIO_Port,SDA2_Pin,GPIO_PIN_SET)    // 输出高电平
#define I2C_SDA_LOW()                       HAL_GPIO_WritePin(SDA2_GPIO_Port,SDA2_Pin,GPIO_PIN_RESET)  // 输出低电平
#define I2C_SDA_READ()                      HAL_GPIO_ReadPin(SDA2_GPIO_Port,SDA2_Pin)

/*
 * AT24C02 2kb = 2048bit = 2048/8 B = 256 B
 * 32 pages of 8 bytes each
 *
 * Device Address
 * 1 0 1 0 A2 A1 A0 R/W
 * 1 0 1 0 0  0  0  0 = 0XA0
 * 1 0 1 0 0  0  0  1 = 0XA1
 */

/* AT24C01/02每页有8个字节
 * AT24C04/08A/16A每页有16个字节
 */
#define EEPROM_DEV_ADDR			   0xA0	    	/* 24xx02的设备地址 */
#define EEPROM_PAGE_SIZE		      8			  /* 24xx02的页面大小 */
#define EEPROM_SIZE				      256			  /* 24xx02总容量 */

/* 扩展变量 ------------------------------------------------------------------*/
/* 函数声明 ------------------------------------------------------------------*/
void    I2C_Start(void);
void    I2C_Stop(void);
void    I2C_SendByte(uint8_t _ucByte);
uint8_t I2C_ReadByte(void);
uint8_t I2C_WaitAck(void);
void    I2C_Ack(void);
void    I2C_NAck(void);
uint8_t I2C_CheckDevice(uint8_t _Address);

uint8_t EEPROM_CheckOk(void);
uint8_t EEPROM_ReadBytes(uint8_t *_pReadBuf, uint16_t _usAddress, uint16_t _usSize);
uint8_t EEPROM_WriteBytes(uint8_t *_pWriteBuf, uint16_t _usAddress, uint16_t _usSize);



#endif /* __I2C_EEPROM_H__ */

/******************* (C) COPYRIGHT 2015-2020 硬石嵌入式开发团队 *****END OF FILE****/
